In [1]:
# import
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#### Object Creation - Series and DataFrame

In [2]:
# creating Series (array)

s1 = pd.Series([[1,3,5,np.nan,6,8]])
s1

0    [1, 3, 5, nan, 6, 8]
dtype: object

In [3]:
# creating DataFrames
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.520961  0.711444 -0.034715 -0.409015
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759
2013-01-03  1.140385  2.714687 -1.396521 -1.227747
2013-01-04  1.203215 -0.071667 -0.856241 -2.520263
2013-01-05  1.753259  1.480953 -0.811564 -1.183239
2013-01-06  0.741143 -0.816589  0.220061 -0.506163

In [5]:
# Creating a DataFrame by passing a dict of objects that can be converted to series-like.
df2 = pd.DataFrame({ 'A' : 1.,
                         'B' : pd.Timestamp('20130102'),
                         'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                         'D' : np.array([3] * 4,dtype='int32'),
                         'E' : pd.Categorical(["test","train","test","train"]),
                         'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
# checking Data Types
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
# Use df2.<TAB> for column name completion as well as attributes which can work on dataframe

#### Viewing Data

In [9]:
# for first 5 records
df.head()

                   A         B         C         D
2013-01-01  0.520961  0.711444 -0.034715 -0.409015
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759
2013-01-03  1.140385  2.714687 -1.396521 -1.227747
2013-01-04  1.203215 -0.071667 -0.856241 -2.520263
2013-01-05  1.753259  1.480953 -0.811564 -1.183239

In [10]:
# for last 3
df.tail(3)

                   A         B         C         D
2013-01-04  1.203215 -0.071667 -0.856241 -2.520263
2013-01-05  1.753259  1.480953 -0.811564 -1.183239
2013-01-06  0.741143 -0.816589  0.220061 -0.506163

In [11]:
# checking df index
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
# column names
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
# df values
df.values

array([[ 0.52096137,  0.7114445 , -0.03471456, -0.40901506],
       [ 0.75987139, -1.18416477, -0.56027278, -1.1107593 ],
       [ 1.14038489,  2.714687  , -1.39652051, -1.22774733],
       [ 1.2032152 , -0.07166667, -0.85624099, -2.52026287],
       [ 1.75325931,  1.48095336, -0.81156359, -1.18323884],
       [ 0.74114305, -0.81658863,  0.22006055, -0.50616336]])

#### Summary of Data

In [14]:
# information abt df
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [15]:
# describing stastistic summay
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   1.019806  0.472444 -0.573209 -1.159531
std    0.442763  1.469958  0.588928  0.754897
min    0.520961 -1.184165 -1.396521 -2.520263
25%    0.745825 -0.630358 -0.845072 -1.216620
50%    0.950128  0.319889 -0.685918 -1.146999
75%    1.187508  1.288576 -0.166104 -0.657312
max    1.753259  2.714687  0.220061 -0.409015

#### Transposing and Sorting the data

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.520961    0.759871    1.140385    1.203215    1.753259    0.741143
B    0.711444   -1.184165    2.714687   -0.071667    1.480953   -0.816589
C   -0.034715   -0.560273   -1.396521   -0.856241   -0.811564    0.220061
D   -0.409015   -1.110759   -1.227747   -2.520263   -1.183239   -0.506163

In [21]:
# Sorting by index
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.409015 -0.034715  0.711444  0.520961
2013-01-02 -1.110759 -0.560273 -1.184165  0.759871
2013-01-03 -1.227747 -1.396521  2.714687  1.140385
2013-01-04 -2.520263 -0.856241 -0.071667  1.203215
2013-01-05 -1.183239 -0.811564  1.480953  1.753259
2013-01-06 -0.506163  0.220061 -0.816589  0.741143

In [22]:
# sorting by values
df.sort_values(by="B")

                   A         B         C         D
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759
2013-01-06  0.741143 -0.816589  0.220061 -0.506163
2013-01-04  1.203215 -0.071667 -0.856241 -2.520263
2013-01-01  0.520961  0.711444 -0.034715 -0.409015
2013-01-05  1.753259  1.480953 -0.811564 -1.183239
2013-01-03  1.140385  2.714687 -1.396521 -1.227747

In [23]:
df.sort_values(by=["B", "A"])

                   A         B         C         D
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759
2013-01-06  0.741143 -0.816589  0.220061 -0.506163
2013-01-04  1.203215 -0.071667 -0.856241 -2.520263
2013-01-01  0.520961  0.711444 -0.034715 -0.409015
2013-01-05  1.753259  1.480953 -0.811564 -1.183239
2013-01-03  1.140385  2.714687 -1.396521 -1.227747

#### Selection of Data

In pandas, data can be accessed with these methods ```.at, .iat, .loc, .iloc and .ix```

In [24]:
# selecting a column A
df['A']

2013-01-01    0.520961
2013-01-02    0.759871
2013-01-03    1.140385
2013-01-04    1.203215
2013-01-05    1.753259
2013-01-06    0.741143
Freq: D, Name: A, dtype: float64

In [26]:
# slicing rows
df[0:3]

                   A         B         C         D
2013-01-01  0.520961  0.711444 -0.034715 -0.409015
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759
2013-01-03  1.140385  2.714687 -1.396521 -1.227747

In [27]:
df['2013-01-01':'2013-01-03']

                   A         B         C         D
2013-01-01  0.520961  0.711444 -0.034715 -0.409015
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759
2013-01-03  1.140385  2.714687 -1.396521 -1.227747

#### Selection by lable

In [28]:
# cross selection using a lable
df.loc[dates[0]]

A    0.520961
B    0.711444
C   -0.034715
D   -0.409015
Name: 2013-01-01 00:00:00, dtype: float64

In [29]:
df.loc[:, ['A', 'B']]   # [row, column]

                   A         B
2013-01-01  0.520961  0.711444
2013-01-02  0.759871 -1.184165
2013-01-03  1.140385  2.714687
2013-01-04  1.203215 -0.071667
2013-01-05  1.753259  1.480953
2013-01-06  0.741143 -0.816589

In [30]:
# Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.759871 -1.184165
2013-01-03  1.140385  2.714687
2013-01-04  1.203215 -0.071667

In [31]:
df.loc['20130102',['A','B']]

A    0.759871
B   -1.184165
Name: 2013-01-02 00:00:00, dtype: float64

In [32]:
# For getting a scalar value
df.loc['20130102',['A']]

A    0.759871
Name: 2013-01-02 00:00:00, dtype: float64

In [34]:
df.loc['20130102','B']

-1.1841647703432259

In [41]:
# for faster access
#df.at['20130102', 'A']

#### Selection by Position

In [42]:
# Select via the position of the passed integers
df.iloc[3]

A    1.203215
B   -0.071667
C   -0.856241
D   -2.520263
Name: 2013-01-04 00:00:00, dtype: float64

In [46]:
# By integer slices, acting similar to numpy/python
df.iloc[3:5, 2:4]   # row - 3 n 4 , col = 2, 3

                   C         D
2013-01-04 -0.856241 -2.520263
2013-01-05 -0.811564 -1.183239

In [47]:
# By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,3,4], 2:4]

                   C         D
2013-01-02 -0.560273 -1.110759
2013-01-04 -0.856241 -2.520263
2013-01-05 -0.811564 -1.183239

In [49]:
# For slicing rows explicitly
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759
2013-01-03  1.140385  2.714687 -1.396521 -1.227747

In [50]:
# For slicing columns explicitly
df.iloc[:,1:3]

                   B         C
2013-01-01  0.711444 -0.034715
2013-01-02 -1.184165 -0.560273
2013-01-03  2.714687 -1.396521
2013-01-04 -0.071667 -0.856241
2013-01-05  1.480953 -0.811564
2013-01-06 -0.816589  0.220061

In [51]:
# For getting a value explicitly
df.iloc[1,1]

-1.1841647703432259

In [52]:
df.loc['2013-01-02', 'B']

-1.1841647703432259

In [54]:
# For getting fast access to a scalar (equiv to the prior method)
df.iat[1,1]

-1.1841647703432259

#### Boolean Indexing

In [57]:
df.B > 0

2013-01-01     True
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: B, dtype: bool

In [58]:
df[df.B > 0]

                   A         B         C         D
2013-01-01  0.520961  0.711444 -0.034715 -0.409015
2013-01-03  1.140385  2.714687 -1.396521 -1.227747
2013-01-05  1.753259  1.480953 -0.811564 -1.183239

In [59]:
df[df>0]

                   A         B         C   D
2013-01-01  0.520961  0.711444       NaN NaN
2013-01-02  0.759871       NaN       NaN NaN
2013-01-03  1.140385  2.714687       NaN NaN
2013-01-04  1.203215       NaN       NaN NaN
2013-01-05  1.753259  1.480953       NaN NaN
2013-01-06  0.741143       NaN  0.220061 NaN

In [60]:
# Using the isin() method for filtering:
df3 = df.copy()

df3['E'] = ['one', 'one','two','three','four','three']

df3

                   A         B         C         D      E
2013-01-01  0.520961  0.711444 -0.034715 -0.409015    one
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759    one
2013-01-03  1.140385  2.714687 -1.396521 -1.227747    two
2013-01-04  1.203215 -0.071667 -0.856241 -2.520263  three
2013-01-05  1.753259  1.480953 -0.811564 -1.183239   four
2013-01-06  0.741143 -0.816589  0.220061 -0.506163  three

In [61]:
df3[df3['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.140385  2.714687 -1.396521 -1.227747   two
2013-01-05  1.753259  1.480953 -0.811564 -1.183239  four

#### Setting a new column

In [63]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [64]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.520961  0.711444 -0.034715 -0.409015  NaN
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759  1.0
2013-01-03  1.140385  2.714687 -1.396521 -1.227747  2.0
2013-01-04  1.203215 -0.071667 -0.856241 -2.520263  3.0
2013-01-05  1.753259  1.480953 -0.811564 -1.183239  4.0
2013-01-06  0.741143 -0.816589  0.220061 -0.506163  5.0

In [65]:
# Setting values by label
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.711444 -0.034715 -0.409015  NaN
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759  1.0
2013-01-03  1.140385  2.714687 -1.396521 -1.227747  2.0
2013-01-04  1.203215 -0.071667 -0.856241 -2.520263  3.0
2013-01-05  1.753259  1.480953 -0.811564 -1.183239  4.0
2013-01-06  0.741143 -0.816589  0.220061 -0.506163  5.0

In [67]:
# Setting values by position
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.034715 -0.409015  NaN
2013-01-02  0.759871 -1.184165 -0.560273 -1.110759  1.0
2013-01-03  1.140385  2.714687 -1.396521 -1.227747  2.0
2013-01-04  1.203215 -0.071667 -0.856241 -2.520263  3.0
2013-01-05  1.753259  1.480953 -0.811564 -1.183239  4.0
2013-01-06  0.741143 -0.816589  0.220061 -0.506163  5.0

In [68]:
# Setting by assigning with a numpy array
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.034715  5  NaN
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0
2013-01-03  1.140385  2.714687 -1.396521  5  2.0
2013-01-04  1.203215 -0.071667 -0.856241  5  3.0
2013-01-05  1.753259  1.480953 -0.811564  5  4.0
2013-01-06  0.741143 -0.816589  0.220061  5  5.0

In [73]:
df2 = df.copy()
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.034715  5  NaN
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0
2013-01-03  1.140385  2.714687 -1.396521  5  2.0
2013-01-04  1.203215 -0.071667 -0.856241  5  3.0
2013-01-05  1.753259  1.480953 -0.811564  5  4.0
2013-01-06  0.741143 -0.816589  0.220061  5  5.0

In [75]:
# to replace all the positive value from its negative

df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.034715 -5  NaN
2013-01-02 -0.759871 -1.184165 -0.560273 -5 -1.0
2013-01-03 -1.140385 -2.714687 -1.396521 -5 -2.0
2013-01-04 -1.203215 -0.071667 -0.856241 -5 -3.0
2013-01-05 -1.753259 -1.480953 -0.811564 -5 -4.0
2013-01-06 -0.741143 -0.816589 -0.220061 -5 -5.0

In [76]:
df2[df2 < 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.034715  5  NaN
2013-01-02  0.759871  1.184165  0.560273  5  1.0
2013-01-03  1.140385  2.714687  1.396521  5  2.0
2013-01-04  1.203215  0.071667  0.856241  5  3.0
2013-01-05  1.753259  1.480953  0.811564  5  4.0
2013-01-06  0.741143  0.816589  0.220061  5  5.0

#### Missing Data

In [82]:
# Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -0.034715  5  NaN NaN
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0 NaN
2013-01-03  1.140385  2.714687 -1.396521  5  2.0 NaN
2013-01-04  1.203215 -0.071667 -0.856241  5  3.0 NaN

In [83]:
df1.loc[dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.034715  5  NaN  NaN
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0  1.0
2013-01-03  1.140385  2.714687 -1.396521  5  2.0  NaN
2013-01-04  1.203215 -0.071667 -0.856241  5  3.0  NaN

In [84]:
# to drop any rows that have missing data.
df1.dropna(how='any')   # if any columns have NULL or NaN

                   A         B         C  D    F    E
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0  1.0

In [85]:
df1.dropna()

                   A         B         C  D    F    E
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0  1.0

In [89]:
df1.dropna(how='all')   # if ALL columns have NULL or NaN

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.034715  5  NaN  NaN
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0  1.0
2013-01-03  1.140385  2.714687 -1.396521  5  2.0  NaN
2013-01-04  1.203215 -0.071667 -0.856241  5  3.0  NaN

#### Filling missing data

In [93]:
df1.fillna(3)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.034715  5  3.0  3.0
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0  1.0
2013-01-03  1.140385  2.714687 -1.396521  5  2.0  3.0
2013-01-04  1.203215 -0.071667 -0.856241  5  3.0  3.0

In [94]:
df1.fillna(value=4)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.034715  5  4.0  4.0
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0  1.0
2013-01-03  1.140385  2.714687 -1.396521  5  2.0  4.0
2013-01-04  1.203215 -0.071667 -0.856241  5  3.0  4.0

In [95]:
df1.fillna({'F':3, 'E':2.9})   # Fill F column with 3 and E column wih 2.9

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.034715  5  3.0  2.9
2013-01-02  0.759871 -1.184165 -0.560273  5  1.0  1.0
2013-01-03  1.140385  2.714687 -1.396521  5  2.0  2.9
2013-01-04  1.203215 -0.071667 -0.856241  5  3.0  2.9

In [96]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True   True
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

#### Stats

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 5 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null int32
F    5 non-null float64
dtypes: float64(4), int32(1)
memory usage: 264.0 bytes

In [98]:
df.describe()

              A         B         C    D         F
count  6.000000  6.000000  6.000000  6.0  5.000000
mean   0.932979  0.353870 -0.573209  5.0  3.000000
std    0.587558  1.475507  0.588928  0.0  1.581139
min    0.000000 -1.184165 -1.396521  5.0  1.000000
25%    0.745825 -0.630358 -0.845072  5.0  2.000000
50%    0.950128 -0.035833 -0.685918  5.0  3.000000
75%    1.187508  1.110715 -0.166104  5.0  4.000000
max    1.753259  2.714687  0.220061  5.0  5.000000

In [99]:
df.count()

A    6
B    6
C    6
D    6
F    5
dtype: int64

In [100]:
df.mean()  # column wise

A    0.932979
B    0.353870
C   -0.573209
D    5.000000
F    3.000000
dtype: float64

In [101]:
df.mean(1)  # row wise

2013-01-01    1.241321
2013-01-02    1.003087
2013-01-03    1.891710
2013-01-04    1.655062
2013-01-05    2.284530
2013-01-06    2.028923
Freq: D, dtype: float64

In [102]:
df.std()

A    0.587558
B    1.475507
C    0.588928
D    0.000000
F    1.581139
dtype: float64

In [103]:
df.std(1)

2013-01-01    2.505839
2013-01-02    2.411568
2013-01-03    2.330635
2013-01-04    2.371174
2013-01-05    2.282016
2013-01-06    2.769562
Freq: D, dtype: float64

In [104]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [105]:
s = s.shift(2)  # shifting the content by 2 index
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [106]:
 df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.140385  1.714687 -2.396521  4.0  1.0
2013-01-04 -1.796785 -3.071667 -3.856241  2.0  0.0
2013-01-05 -3.246741 -3.519047 -5.811564  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

#### Apply

In [107]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.034715   5   NaN
2013-01-02  0.759871 -1.184165 -0.594987  10   1.0
2013-01-03  1.900256  1.530522 -1.991508  15   3.0
2013-01-04  3.103471  1.458856 -2.847749  20   6.0
2013-01-05  4.856731  2.939809 -3.659312  25  10.0
2013-01-06  5.597874  2.123220 -3.439252  30  15.0

In [108]:
df.apply(lambda x: x.max() - x.min())

A    1.753259
B    3.898852
C    1.616581
D    0.000000
F    4.000000
dtype: float64

#### Histogramming

In [110]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    0
2    4
3    0
4    5
5    6
6    0
7    1
8    2
9    2
dtype: int32

In [111]:
s.value_counts()  # checking unique value counts

0    3
6    2
2    2
5    1
4    1
1    1
dtype: int64

#### String Methods

In [112]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [113]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

#### Merge
1. Concat

In [114]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.537094  0.698026 -0.174029  0.640475
1  0.560535 -0.292955 -1.224335  0.664272
2 -0.916409  2.345838  0.331985  0.354038
3 -0.239385 -1.872386 -2.258688 -0.114387
4 -1.499201 -1.845529 -0.882642  1.177756
5  0.619245  0.364519 -0.107899 -2.085298
6  1.684496  1.175950  1.260316 -0.463028
7 -1.744094  0.216086 -0.612019  1.294318
8 -0.768790 -0.258877  0.121382 -0.278438
9  0.534985  0.904519  0.583858 -1.733096

In [115]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.537094  0.698026 -0.174029  0.640475
 1  0.560535 -0.292955 -1.224335  0.664272
 2 -0.916409  2.345838  0.331985  0.354038,
           0         1         2         3
 3 -0.239385 -1.872386 -2.258688 -0.114387
 4 -1.499201 -1.845529 -0.882642  1.177756
 5  0.619245  0.364519 -0.107899 -2.085298
 6  1.684496  1.175950  1.260316 -0.463028,
           0         1         2         3
 7 -1.744094  0.216086 -0.612019  1.294318
 8 -0.768790 -0.258877  0.121382 -0.278438
 9  0.534985  0.904519  0.583858 -1.733096]

In [117]:
pd.concat(pieces)  # concat rowwise

          0         1         2         3
0 -0.537094  0.698026 -0.174029  0.640475
1  0.560535 -0.292955 -1.224335  0.664272
2 -0.916409  2.345838  0.331985  0.354038
3 -0.239385 -1.872386 -2.258688 -0.114387
4 -1.499201 -1.845529 -0.882642  1.177756
5  0.619245  0.364519 -0.107899 -2.085298
6  1.684496  1.175950  1.260316 -0.463028
7 -1.744094  0.216086 -0.612019  1.294318
8 -0.768790 -0.258877  0.121382 -0.278438
9  0.534985  0.904519  0.583858 -1.733096

In [119]:
pd.concat(pieces, axis=1)  # concat column wise

,0,1,2,3,0,1,2,3,0,1,2,3
0,-0.537094,0.698026,-0.174029,0.640475,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,0.560535,-0.292955,-1.224335,0.664272,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,-0.916409,2.345838,0.331985,0.354038,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,-0.239385,-1.872386,-2.258688,-0.114387,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,-1.499201,-1.845529,-0.882642,1.177756,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,0.619245,0.364519,-0.107899,-2.085298,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,1.684496,1.175950,1.260316,-0.463028,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-1.744094,0.216086,-0.612019,1.294318
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,-0.768790,-0.258877,0.121382,-0.278438
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.534985,0.904519,0.583858,-1.733096

#### Join

```
pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None,
         left_index=False, right_index=False, sort=True,
         suffixes=('_x', '_y'), copy=True, indicator=False)
```

In [120]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

left

   key  lval
0  foo     1
1  foo     2

In [121]:
right

   key  rval
0  foo     4
1  foo     5

In [123]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [124]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

left

   key  lval
0  foo     1
1  bar     2

In [125]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

#### Append

In [126]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.907671 -1.151104  0.916186 -0.912144
1 -1.705458 -1.178539  1.500315  0.147830
2  0.151804  0.947909  0.160825  0.752721
3  0.244043  0.986701 -0.528902  1.876813
4  0.539365 -0.016126  1.686511  2.179107
5  0.178578 -0.609517  1.375825 -0.089882
6 -0.456353 -0.638434 -0.456891 -1.398285
7 -1.150975  0.662251 -0.136781 -1.036767

In [128]:
s = df.iloc[3]
s

A    0.244043
B    0.986701
C   -0.528902
D    1.876813
Name: 3, dtype: float64

In [129]:
df.append(s, ignore_index=True)
df

          A         B         C         D
0  0.907671 -1.151104  0.916186 -0.912144
1 -1.705458 -1.178539  1.500315  0.147830
2  0.151804  0.947909  0.160825  0.752721
3  0.244043  0.986701 -0.528902  1.876813
4  0.539365 -0.016126  1.686511  2.179107
5  0.178578 -0.609517  1.375825 -0.089882
6 -0.456353 -0.638434 -0.456891 -1.398285
7 -1.150975  0.662251 -0.136781 -1.036767

#### Grouping

By group by we are referring to a process involving one or more of the following steps

        Splitting the data into groups based on some criteria
        Applying a function to each group independently
        Combining the results into a data structure

In [130]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                       'B' : ['one', 'one', 'two', 'three',
                              'two', 'two', 'one', 'three'],
                       'C' : np.random.randn(8),
                       'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.014655  0.833343
1  bar    one -0.086332 -0.019241
2  foo    two  0.748605 -1.128192
3  bar  three  0.686152  0.146921
4  foo    two  1.339486  0.429317
5  bar    two -1.485134  0.025941
6  foo    one -0.541086 -0.433460
7  foo  three  0.888268 -1.293430

In [131]:
df.groupby('A').sum()

            C         D
A
bar -0.885315  0.153620
foo  2.420617 -1.592422

In [132]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.086332 -0.019241
    three  0.686152  0.146921
    two   -1.485134  0.025941
foo one   -0.555741  0.399884
    three  0.888268 -1.293430
    two    2.088091 -0.698875

#### Reshaping

In [134]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [135]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one     0.179873 -1.023503
      two     0.510842  0.417581
baz   one    -0.180299 -2.378504
      two     0.436018  0.757784
foo   one    -0.870402  0.208840
      two    -0.804211 -1.108037
qux   one    -0.123273  1.879442
      two    -0.912870  0.803389

The stack() method compresses a level in the DataFrames columns

In [137]:
df.stack()

first  second
bar    one     A    0.179873
               B   -1.023503
       two     A    0.510842
               B    0.417581
baz    one     A   -0.180299
               B   -2.378504
       two     A    0.436018
               B    0.757784
foo    one     A   -0.870402
               B    0.208840
       two     A   -0.804211
               B   -1.108037
qux    one     A   -0.123273
               B    1.879442
       two     A   -0.912870
               B    0.803389
dtype: float64

With a stacked DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the last level:

In [138]:
df.unstack()  # this will unstack the inner index (last level)

               A                   B
second       one       two       one       two
first
bar     0.179873  0.510842 -1.023503  0.417581
baz    -0.180299  0.436018 -2.378504  0.757784
foo    -0.870402 -0.804211  0.208840 -1.108037
qux    -0.123273 -0.912870  1.879442  0.803389

In [139]:
df.unstack('first')  # unstacking by lable

               A                                       B                      \
first        bar       baz       foo       qux       bar       baz       foo
second
one     0.179873 -0.180299 -0.870402 -0.123273 -1.023503 -2.378504  0.208840
two     0.510842  0.436018 -0.804211 -0.912870  0.417581  0.757784 -1.108037


first        qux
second
one     1.879442
two     0.803389

In [140]:
df.unstack('second')

               A                   B
second       one       two       one       two
first
bar     0.179873  0.510842 -1.023503  0.417581
baz    -0.180299  0.436018 -2.378504  0.757784
foo    -0.870402 -0.804211  0.208840 -1.108037
qux    -0.123273 -0.912870  1.879442  0.803389

In [143]:
df.unstack(0)    # unstacking by index

               A                                       B                      \
first        bar       baz       foo       qux       bar       baz       foo
second
one     0.179873 -0.180299 -0.870402 -0.123273 -1.023503 -2.378504  0.208840
two     0.510842  0.436018 -0.804211 -0.912870  0.417581  0.757784 -1.108037


first        qux
second
one     1.879442
two     0.803389

#### Pivot Tables

In [144]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                       'B' : ['A', 'B', 'C'] * 4,
                       'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D' : np.random.randn(12),
                       'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.584488 -0.278152
1     one  B  foo -1.163445  2.068393
2     two  C  foo  1.729663 -0.157706
3   three  A  bar  0.216937 -0.002869
4     one  B  bar -0.739287 -0.206657
5     one  C  bar -1.324067 -1.501356
6     two  A  foo  1.135365 -0.160062
7   three  B  foo  0.602475 -0.736220
8     one  C  foo -0.271336  0.690641
9     one  A  bar  1.284953  0.825918
10    two  B  bar  1.427582 -0.138365
11  three  C  bar -1.750369  0.189571

In [145]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.284953  0.584488
      B -0.739287 -1.163445
      C -1.324067 -0.271336
three A  0.216937       NaN
      B       NaN  0.602475
      C -1.750369       NaN
two   A       NaN  1.135365
      B  1.427582       NaN
      C       NaN  1.729663

#### Time Series

In [147]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng[:5]

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04'],
              dtype='datetime64[ns]', freq='S')

In [149]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts[:8]

2012-01-01 00:00:00      1
2012-01-01 00:00:01    161
2012-01-01 00:00:02     65
2012-01-01 00:00:03    171
2012-01-01 00:00:04    455
2012-01-01 00:00:05     35
2012-01-01 00:00:06    173
2012-01-01 00:00:07    158
Freq: S, dtype: int32

In [157]:
ts.sum()

25206

In [159]:
ts.resample('5Min').sum()

2012-01-01    25206
Freq: 5T, dtype: int32

In [156]:
ts.resample('5Min')

AttributeError: 'NoneType' object has no attribute 'get_iterator'

Time zone representation

In [160]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [161]:
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    0.821869
2012-03-07   -0.382285
2012-03-08   -0.267250
2012-03-09    1.273478
2012-03-10    1.020820
Freq: D, dtype: float64

In [162]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    0.821869
2012-03-07 00:00:00+00:00   -0.382285
2012-03-08 00:00:00+00:00   -0.267250
2012-03-09 00:00:00+00:00    1.273478
2012-03-10 00:00:00+00:00    1.020820
Freq: D, dtype: float64

Convert to another time zone

In [167]:
ts_utc.tz_convert('Asia/Calcutta')

2012-03-06 05:30:00+05:30    0.821869
2012-03-07 05:30:00+05:30   -0.382285
2012-03-08 05:30:00+05:30   -0.267250
2012-03-09 05:30:00+05:30    1.273478
2012-03-10 05:30:00+05:30    1.020820
Freq: D, dtype: float64

Converting between time span representations

In [168]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)

ts

2012-01-31    0.142423
2012-02-29    0.393842
2012-03-31    2.134400
2012-04-30    1.863766
2012-05-31    0.106556
Freq: M, dtype: float64

In [170]:
ps = ts.to_period()
ps

2012-01    0.142423
2012-02    0.393842
2012-03    2.134400
2012-04    1.863766
2012-05    0.106556
Freq: M, dtype: float64

In [171]:
ps.to_timestamp()

2012-01-01    0.142423
2012-02-01    0.393842
2012-03-01    2.134400
2012-04-01    1.863766
2012-05-01    0.106556
Freq: MS, dtype: float64

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [173]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)

ts.head()

1990Q1    0.301839
1990Q2    0.305154
1990Q3    0.179484
1990Q4    0.172484
1991Q1   -1.352766
Freq: Q-NOV, dtype: float64

In [174]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

ts.head()

1990-03-01 09:00    0.301839
1990-06-01 09:00    0.305154
1990-09-01 09:00    0.179484
1990-12-01 09:00    0.172484
1991-03-01 09:00   -1.352766
Freq: H, dtype: float64

#### Categoricals

In [176]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [183]:
df.dtypes

id            int64
raw_grade    object
dtype: object

In [184]:
df["grade"] = df["raw_grade"].astype("category")

df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

Rename the categories to more meaningful names (assigning to Series.cat.categories is inplace!)

In [187]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [189]:
# Reorder the categories and simultaneously add the
# missing categories (methods under Series .cat return a new Series per default).

df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [190]:
# Sorting is per order in the categories, not lexical order.
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [191]:
# Grouping by a categorical column shows also empty categories.
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

#### Plotting